# -*- eval: (add-hook 'after-save-hook (lambda () (my/tangle-async)) nil t) -*-
#+property:   header-args :tangle lisp/config.el
#+startup:    overview indent
#+title:      Emacs config
#+options:    \\n:t toc:2
#+category:   configuration
#+parent:     553
#+post_tags:  tools emacs configuration
#+postid:     638
#+date:       [2023-09-29 Fri 23:49]

** safe vars

#+begin_src emacs-lisp
(setq
  safe-local-variable-values
    '(
     (eval add-hook 'after-save-hook (lambda nil (my/tangle-async)) nil t)
     (eval add-hook 'after-save-hook (lambda nil (my/tangle-async-and-byte-compile-init-file)) nil t)
     (org-archive-location . "~/Dropbox/org/archive/%s_archive.gpg::")
     (org-tags-column . -65)
     (eval setq org-cycle-include-plain-lists 'integrate)
     (eval load-file "ledger-kredo-regex.el.gpg")
     (doom-modeline-buffer-file-name-style . truncate-with-project)
     (doom-modeline-buffer-file-name-style quote truncate-with-project)
     (org-hugo-footer . "

[//]: # \"Exported with love from a post written in Org mode\"
[//]: # \"- https://github.com/kaushalmodi/ox-hugo\"")
     (checkdoc-minor-mode . t)
     (flycheck-disabled-checkers emacs-lisp-checkdoc)
     (eval visual-line-mode t))

   ; tramp theme
   custom-safe-themes '("6ebdb33507c7db94b28d7787f802f38ac8d2b8cd08506797b3af6cdfd80632e0" default)
)
#+end_src

#+RESULTS:
| 6ebdb33507c7db94b28d7787f802f38ac8d2b8cd08506797b3af6cdfd80632e0 | default |

